cgueble/ESP8266_Door_Status/porte_thingspeaks/build/sketch/build/sketch/build/sketch/porte_thingspeaks.ino.cpp
  if ((Status_IlsPorte == true && DoorClosedBack == true )) //Detecte l'ouverture de la porte
  {
    DoorClosedBack = false;
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println();
      Serial.println("Door seen open");
      Serial.println("Debut traitement IlsPorte");
      Serial.println("1 minute d'attente avant de continuer le traitement");
    }
    MailContent = String("Ouverture porte \r\n");
    UpdateTime();
    delay(60000);// wait for 1 minute before sending mail
    Read_Button(IlsPorte, Verrou);
    if (Status_IlsPorte == false) {
      DoorClosedBack = true;
      MailContent = String("Ouverture et refermeture porte \r\n");
    }
    if (sendEmail(MailFrom, MailTo, MailContent, ThingspeakChannelAdress, ThingspeakWriteAPIKey)) {
      Old_Status_Verrou = Status_Verrou;
      Status_Verrou_Change = false;
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email sent");
      }
    }
    else
    {
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email failed");
      }
    }
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Ready for new acquisition");
    }
  }// fin Status_IlsPorte==true


  if (Status_Verrou_Change == true) { // traitement du changement d'Ã©tat du verrou
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Debut traitement Verrou");
      Serial.println();
      Serial.println("Verrou status changed");
      Serial.println("Debut traitement ILS verrou");
    }
    MailContent = String("Le statut du verrou change \r\n");
    UpdateTime();
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("mail content value=  ");
      Serial.println(MailContent);
    }
    delay(60000);// wait for 1 minute before sending mail
    Read_Button(IlsPorte, Verrou);
    if (sendEmail(MailFrom, MailTo, MailContent, ThingspeakChannelAdress, ThingspeakWriteAPIKey)) {
      Status_Verrou_Change = false;
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email sent");
      }
    }
    else
    {
      if (SERIAL_PORT_LOG_ENABLE) {
        Serial.println("Email failed");
      }
    }
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("Ready for new acquisition");
    }
  }  //fin status_Verrou == true

  //debut daily mail

  if (Hour == 8) // tant qu'il est 8h locale, on re autorise le daily mail
  {
    DailyMailSent = false;
  }// fin rearm daily mail

  if ((Hour > 8) && (DailyMailSent == false)) // a partir de 9h00 locale, si le Daily mail n'a pas ete envoye, alors on l'envoie
  {
    sendDailyMail();
  }

  if (SERIAL_PORT_LOG_ENABLE) {
  Serial.print("millis() - lastConnectionTime = ");
  Serial.println(millis() - lastConnectionTime );
  }

  if (millis() - lastConnectionTime > RegularpostingInterval) {
    mqttpublishtry();
  }






//ESP.deepSleep(24*3600*1000000, WAKE_NO_RFCAL);  // Sleep pour 1 jour
//ESP.deepSleep(2*60*1000000, WAKE_NO_RFCAL); // Sleep pour 2 minutes
//Waikup on GPIO16 reset.... witch Pin ???

}//*****************END OF LOOP *******************

void UpdateTime() {
  StringDate = ""; // reset StringDate value
  StringTime = ""; // reset StringTime value
  Hour = hour();
  Minute = minute();
  Second = second();
  Year = year();
  Month = month();
  Day = day();
  WeekDay = weekday();

  if ((Month <= 3) || (Month > 10)) { // on est un mois d'hiver
    if ((Month == 3) && (Day - WeekDay > 24)) { //on est dans le dernier mois d'hiver et aprÃ¨s le dernier dimanche
      Hour = Hour + 2;
      StringTime += " UTC+2: ";
      if (Hour >= 22){
        Day = Day + 1;
      }
    }
    else { // toute la periode hivernale
      Hour = Hour + 1;
      StringTime += " UTC+1: ";
        if (Hour >= 23){
        Day = Day + 1;
      }
    }
  }
  else { // on est un mois d'aout
    if ((Month == 10) && (Day - WeekDay > 24)) { //on est dans le dernier mois d'aout et apres le dernier dimanche
      Hour = Hour + 1;
      StringTime += " UTC+1: ";
      if (Hour >= 23){
        Day = Day + 1;
      }
    }
    else { // toute la periode estivale
      Hour = Hour + 2;
      StringTime += " UTC+2: ";
      if (Hour >= 22){
        Day = Day + 1;
      }
    }
  }

  //StringDate += "Date: ";
  if (Day < 10) {
    StringDate += "0";
  }
  StringDate += Day;
  if (Month < 10) {
    StringDate += "/0";
  }
  else {
    StringDate += "/";
  }
  StringDate += Month;
  StringDate += "/";
  StringDate += Year;

  if (Hour < 10) {
    StringTime += "0";
  }
  StringTime += Hour;
  if (Minute < 10) {
    StringTime += ":0";
  }
  else {
    StringTime += ":";
  }
  StringTime += Minute;
  if (Second < 10) {
    StringTime += ":0";
  }
  else {
    StringTime += ":";
  }
  StringTime += Second;
  if (SERIAL_PORT_LOG_ENABLE) {
    //Serial.print("valeure de StringDate ");
    //Serial.println(StringDate);
    //Serial.print("valeure de StringTime ");
    //Serial.println(StringTime);
  }
}//End of Update Time


void GetTimeByUDP() {
  //get a random server from the pool
  WiFi.hostByName(ntpServerName, timeServerIP);

  sendNTPpacket(timeServerIP); // send an NTP packet to a time server
  // wait to see if a reply is available
  delay(1000);


  int cb = udp.parsePacket();

  if (!cb) {
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.println("no packet yet");
    }
  }
  else {
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("packet received, length=");
      Serial.println(cb);
    }

    // We've received a packet, read the data from it
    udp.read(packetBuffer, NTP_PACKET_SIZE); // read the packet into the buffer

    //the timestamp starts at byte 40 of the received packet and is four bytes,
    // or two words, long. First, esxtract the two words:

    unsigned long highWord = word(packetBuffer[40], packetBuffer[41]);
    unsigned long lowWord = word(packetBuffer[42], packetBuffer[43]);
    // combine the four bytes (two words) into a long integer
    // this is NTP time (seconds since Jan 1 1900):
    secsSince1900 = highWord << 16 | lowWord;
    if (SERIAL_PORT_LOG_ENABLE) {
      Serial.print("Seconds since Jan 1 1900 = " );
      Serial.println(secsSince1900);
    }

    // now convert NTP time into everyday time:
    // Unix time starts on Jan 1 1970. In seconds, that's 2208988800:
    const unsigned long seventyYears = 2208988800UL;
    // subtract seventy years:
    epoch = secsSince1900 - seventyYears;
    setTime(epoch);

